insert into type_discount (name_type) values ('АКЦИЯ'), ('СКИДКА')

insert into discounts (type_discount, description, image)
values (1, '20% на стрижку', 'https://vhost226204.cpsite.ru/bratishka/images/discounts/discount.png'),
       (1, '30% на стрижку', 'https://vhost226204.cpsite.ru/bratishka/images/discounts/discount1.png'),
       (2, '1 стрижка в братишке - 300 рублей', 'https://vhost226204.cpsite.ru/bratishka/images/discounts/share.png'),
       (2, '5% скидка на товары', 'https://vhost226204.cpsite.ru/bratishka/images/discounts/share1.png')

insert into products (name_product, type_product_id, price, description, rating, image, icon)
values ('Масло для бороды Alpha Home', 3, 600, 'Estel Professional Масло Alpha Homme для волос и бороды', 5.0,
        'http://vhost226204.cpsite.ru/bratishka/images/products/image/oil_for_beard_image.png',
        'http://vhost226204.cpsite.ru/bratishka/images/products/icon/oil_for_beard_icon.png'),
       ('Шампунь Alpha Home против перхоти', 1, 600, 'Шампунь Estel Alpha Home против перхоти', 4.8,
       'http://vhost226204.cpsite.ru/bratishka/images/products/image/shampoo_anti_dandruff_image.png',
       'http://vhost226204.cpsite.ru/bratishka/images/products/icon/shampoo_anti_dandruff_icon.png'),
       ('Шампунь Alpha Home', 1, 600, 'Шампунь Estel Alpha Home с охлаждающим эффектов', 4.9,
       'http://vhost226204.cpsite.ru/bratishka/images/products/image/shampoo_image.png',
       'http://vhost226204.cpsite.ru/bratishka/images/products/icon/shampoo_icon.png'),
       ('Пудра Alpha Home', 2, 600, 'Пудра для создания объема волос', 4.7,
       'http://vhost226204.cpsite.ru/bratishka/images/products/image/powder_image.png',
       'http://vhost226204.cpsite.ru/bratishka/images/products/icon/powder_icon.png'),
       ('Сумка Братишка из натуральной кожи', 4, 3000, 'Имеет потайной карман для денег и регулируемый ремень.', 5.0,
       'http://vhost226204.cpsite.ru/bratishka/images/products/image/bag_image.png',
       'http://vhost226204.cpsite.ru/bratishka/images/products/icon/bag_icon.png'),
       ('Нарды от братишки', 4, 13000, 'Купи нардишки, чтобы не скучать с братишкой!', 5.0,
       'http://vhost226204.cpsite.ru/bratishka/images/products/image/backgammons_image.png',
       'http://vhost226204.cpsite.ru/bratishka/images/products/icon/backgammon_icon.png');

insert into haircuts (name_haircut, price, icon)
values
('Стрижка братишки', 500, 'http://vhost226204.cpsite.ru/bratishka/images/haircuts/haircut_bratishka_icon.png'),
('Стрижка братишки', 600, 'http://vhost226204.cpsite.ru/bratishka/images/haircuts/haircut_bratishka_icon.png'),
('Стрижка братишки', 700, 'http://vhost226204.cpsite.ru/bratishka/images/haircuts/haircut_bratishka_icon.png'),
('Стрижка машинкой', 200, 'http://vhost226204.cpsite.ru/bratishka/images/haircuts/haircut_machin_icon.png'),
('Стрижка машинкой', 300, 'http://vhost226204.cpsite.ru/bratishka/images/haircuts/haircut_machin_icon.png'),
('Детская стрижка', 400, 'http://vhost226204.cpsite.ru/bratishka/images/haircuts/haircut_machin_icon.png'),
('Детская стрижка', 500, 'http://vhost226204.cpsite.ru/bratishka/images/haircuts/haircut_machin_icon.png'),
('Моделирование бороды', 500, 'http://vhost226204.cpsite.ru/bratishka/images/haircuts/icon/model_beard_icon.png'),
('Моделирование бороды', 600, 'http://vhost226204.cpsite.ru/bratishka/images/haircuts/icon/model_beard_icon.png'),
('Братишка+Сынишка', 800, 'http://vhost226204.cpsite.ru/bratishka/images/haircuts/bratishka_synishka_icon.png'),
('Братишка+Сынишка', 900, 'http://vhost226204.cpsite.ru/bratishka/images/haircuts/bratishka_synishka_icon.png'),
('Братишка+Сынишка', 1100, 'http://vhost226204.cpsite.ru/bratishka/images/haircuts/bratishka_synishka_icon.png'),
('Братишка+Братишка', 800, 'http://vhost226204.cpsite.ru/bratishka/images/haircuts/bratishka_bratishka_icon.png'),
('Братишка+Братишка', 1000, 'http://vhost226204.cpsite.ru/bratishka/images/haircuts/bratishka_bratishka_icon.png'),
('Братишка+Братишка', 1200, 'http://vhost226204.cpsite.ru/bratishka/images/haircuts/bratishka_bratishka_icon.png'),
('Стрижка бороды', 300, 'http://vhost226204.cpsite.ru/bratishka/images/haircuts/haircut_beard_icon.png'),
('Стрижка бороды', 400, 'http://vhost226204.cpsite.ru/bratishka/images/haircuts/haircut_beard_icon.png');

insert into haircuts (name, price)
values
('Комбо 1 (Стрижка+Стрижка бороды)', 700),
('Комбо 1 (Стрижка+Стрижка бороды)', 900),
('Комбо 2 (Стрижка+Моделирование бороды)', 900),
('Комбо 2 (Стрижка+Моделирование бороды)', 1100),
('Комбо 3 (Стрижка+Стрижка бороды+Тонирование)', 1200),
('Комбо 3 (Стрижка+Стрижка бороды+Тонирование)', 1400),
('Комбо 4 (Стрижка+Моделирование бороды+Тонирование)', 1400),
('Комбо 4 (Стрижка+Моделирование бороды+Тонирование)', 1600),
('Удаление волос воском', 100),
('Тонирование бороды', 600),
('Тонирование бороды', 600);


insert into free_days (free_date, free_time)
values
       ('2022-06-02', '14:00:00'),
       ('2022-06-02', '16:00:00'),
       ('2022-06-02', '18:00:00'),
       ('2022-06-02', '20:00:00'),
       ('2022-06-04', '12:00:00'),
       ('2022-06-04', '14:00:00'),
       ('2022-06-04', '16:00:00'),
       ('2022-06-04', '18:00:00'),
       ('2022-06-04', '20:00:00'),
       ('2022-06-06', '12:00:00'),
       ('2022-06-06', '14:00:00'),
       ('2022-06-06', '16:00:00'),
       ('2022-06-06', '18:00:00'),
       ('2022-06-06', '20:00:00'),
       ('2022-06-08', '12:00:00'),
       ('2022-06-08', '14:00:00'),
       ('2022-06-08', '16:00:00'),
       ('2022-06-08', '18:00:00'),
       ('2022-06-08', '20:00:00'),
       ('2022-06-10', '12:00:00'),
       ('2022-06-10', '14:00:00'),
       ('2022-06-10', '16:00:00'),
       ('2022-06-10', '18:00:00'),
       ('2022-06-10', '20:00:00'),
       ('2022-06-12', '12:00:00'),
       ('2022-06-12', '14:00:00'),
       ('2022-06-12', '16:00:00'),
       ('2022-06-12', '18:00:00'),
       ('2022-06-12', '20:00:00'),
       ('2022-06-14', '12:00:00'),
       ('2022-06-14', '14:00:00'),
       ('2022-06-14', '16:00:00'),
       ('2022-06-14', '18:00:00'),
       ('2022-06-14', '20:00:00'),
       ('2022-06-16', '12:00:00'),
       ('2022-06-16', '14:00:00'),
       ('2022-06-16', '16:00:00'),
       ('2022-06-16', '18:00:00'),
       ('2022-06-16', '20:00:00'),
       ('2022-06-20', '12:00:00'),
       ('2022-06-20', '14:00:00'),
       ('2022-06-20', '16:00:00'),
       ('2022-06-20', '18:00:00'),
       ('2022-06-20', '20:00:00'),
       ('2022-06-24', '12:00:00'),
       ('2022-06-24', '14:00:00'),
       ('2022-06-24', '16:00:00'),
       ('2022-06-24', '18:00:00'),
       ('2022-06-24', '20:00:00'),
       ('2022-06-26', '12:00:00'),
       ('2022-06-26', '14:00:00'),
       ('2022-06-26', '16:00:00'),
       ('2022-06-26', '18:00:00'),
       ('2022-06-26', '20:00:00'),
       ('2022-06-30', '12:00:00'),
       ('2022-06-30', '14:00:00'),
       ('2022-06-30', '16:00:00'),
       ('2022-06-30', '18:00:00'),
       ('2022-06-30', '20:00:00');

insert into branches (city_id, street, latitude, longitude, number_phone, working_mode)
values (1 ,'ул.Победы,132', 53.222024454559765, 50.267849498593655, '+8(800)707-07-68', 'ПН-ВС 10:00 - 21:00'),
       (1 ,'пр.Кирова,130', 53.23128028008097, 50.247162525994476, '+8(800)707-07-68', 'ПН-ВС 10:00 - 21:00'),
       (1 ,'ул.Крутые Ключи, 33', 53.322919257890014, 50.30732737975478, '+8(800)707-07-68', 'ПН-ВС 10:00 - 21:00'),
       (1 ,'ул.Солнечная, 18', 53.24198811116855, 50.186120509186594, '+8(800)707-07-68', 'ПН-ВС 10:00 - 21:00'),
       (1 ,'ул.Осипенко, 32', 53.207704325588864, 50.13703662053694, '+8(800)707-07-68', 'ПН-ВС 10:00 - 21:00'),
       (1 ,'ул.Победы, 111', 53.21834155431505, 50.26117191967973, '+8(800)707-07-68', 'ПН-ВС 10:00 - 21:00'),
       (1 ,'ул.Стара-Загора, 130', 53.246684616490725, 50.23525275088988, '+8(800)707-07-68', 'ПН-ВС 10:00 - 21:00'),
       (1 ,'ул.Свободы, 88', 53.21610987502834, 50.245174805538845, '+8(800)707-07-68', 'ПН-ВС 10:00 - 21:00'),
       (1 ,'ул.Революционная, 156', 53.19319845094151, 50.179509331288926, '+8(800)707-07-68', 'ПН-ВС 10:00 - 21:00'),
       (1 ,'ул.Антонова-Овсеенко, 101', 53.212415084434646, 50.22592190554317, '+8(800)707-07-68', 'ПН-ВС 10:00 - 21:00'),
       (1 ,'ул.Центральная, 25', 53.22089310209954, 50.193722306511425, '+8(800)707-07-68', 'ПН-ВС 10:00 - 21:00'),
       (1 ,'ул.Ново-Вокзальная, 122', 53.23640495094543, 50.217828123107914, '+8(800)707-07-68', 'ПН-ВС 10:00 - 21:00'),
       (2 ,'пр.Ленина, 1', 53.23598248895027, 34.35395107765711, '+8(920)844-00-04', 'ПН-ВС 10:00 - 21:00'),
       (3 ,'ул.40 лет Победы, 131', 45.05626381113144, 39.033246373103665, '+8(800)707-07-68', 'ПН-ВС 10:00 - 21:00'),
       (3 ,'ул.Николая Шевелёва, 3/1', 45.076456955474896, 39.03747997819931, '+8(800)707-07-71', 'ПН-ВС 10:00 - 21:00'),
       (3 ,'ул.Ставропольская, 105', 45.021809512267666, 39.01651278878791, '+8(800)707-07-70', 'ПН-ВС 10:00 - 21:00'),
       (4 ,'ул.Островского, 12', 54.486236272625675, 53.4715500397917, '+8(800)707-07-68', 'ПН-ВС 10:00 - 21:00')


insert into cities (city)
values
('Самара'),
('Брянск'),
('Краснодар'),
('Октябрьский')

insert into city_branch (city_id, branch_id)
values (1, 1, 53.222024454559765, 50.267849498593655),
       (1, 2, 53.23128028008097, 50.247162525994476),
       (1, 3, 53.322919257890014, 50.30732737975478),
       (1, 4, 53.24198811116855, 50.186120509186594),
       (1, 5, 53.207704325588864, 50.13703662053694),
       (1, 6, 53.21834155431505, 50.26117191967973),
       (1, 7, 53.246684616490725, 50.23525275088988),
       (1, 8, 53.21610987502834, 50.245174805538845),
       (1, 9, 53.19319845094151, 50.179509331288926),
       (1, 10, 53.212415084434646, 50.22592190554317),
       (1, 11, 53.22089310209954, 50.193722306511425),
       (1, 12, 53.23640495094543, 50.217828123107914),
       (2, 13, 53.23598248895027, 34.35395107765711),
       (3, 14, 45.05626381113144, 39.033246373103665),
       (3, 15, 45.076456955474896, 39.03747997819931),
       (3, 16, 45.021809512267666, 39.01651278878791),
       (4, 17, 54.486236272625675, 53.4715500397917);

insert into time_for_live_queue (time_live_queue)
values ('10:00', '12:00', '14:00', '16:00', '18:00')

insert into barber_position (position) values ('Братишка'), ('Топ-Братишка'), ('Арт-барбер')